{
    "appid": "&$.test_023..datas[9].app_id&",
    "access_token": "&$.case_100.access_token&",
    "to_users": ["&$.test_010..datas[0].uid&", "&$.test_011..datas[0].uid&", "&$.test_004..datas[0].uid&", "&$.test_005..datas[0].uid&"],
    "type": "attachment",
    "msg_status": "1",
    "message": {
        "id": "594ccc6d20e01c077b5c9013",
        "head": {
            "text": "头部标题的测试头部标题的测试头部标题的测试头部标题的测试头部标题的测试头部标题的测试头部标题的",
            "bgcolor": "FF0000",
            "tcolor": "FF0000"
        },
        "body": {
            "title": "抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试抬头部分测试",
            "content": "正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试正文部分测试",
            "image": "&$.case_022.media_id&"
        },
        "fields": [
            {
                "name": "静态文本框-测试静态文本框-测试静态文本框-测试静态文本框-测试",
                "input": {
                    "type": "text",
                    "childtype": 0,
                    "name": "单选框-单⾏⽂本框",
                    "text": "右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试",
                    "hint": "单⾏⽂本框",
                    "must": true,
                    "expand": true
                }
            },
{
                "name": "静态文本框-测试静态文本框-测试静态文本框-测试静态文本框-测试",
                "input": {
                    "type": "text",
                    "childtype": 0,
                    "name": "单选框-单⾏⽂本框",
                    "text": "右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试",
                    "hint": "单⾏⽂本框",
                    "must": true,
                    "expand": true
                }
            },
{
                "name": "静态文本框-测试静态文本框-测试静态文本框-测试静态文本框-测试",
                "input": {
                    "type": "text",
                    "childtype": 0,
                    "name": "单选框-单⾏⽂本框",
                    "text": "右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试",
                    "hint": "单⾏⽂本框",
                    "must": true,
                    "expand": true
                }
            },
            {
                "name": "多行文本框测试多行文本框测试多行文本框测试多行文本框测试多行文本框测试多行文本框测试多行文本框测试多行文本框测试多行文本框测试多行文本框测试",
                "input": {
                    "type": "text",
                    "childtype": 1,
                    "name": "单选框-多⾏⽂本框",
                    "text": "右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试",
                    "hint": "多⾏⽂本框",
                    "must": true,
                    "expand": false
                }
            },
            {
                "name": "多行文本框-测试",
                "input": {
                    "type": "text",
                    "childtype": 1,
                    "name": "单选框-多⾏⽂本框",
                    "text": "右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试",
                    "hint": "多⾏⽂本框",
                    "must": true,
                    "expand": false
                }
            },
            {
                "name": "多行文本框-测试",
                "input": {
                    "type": "text",
                    "childtype": 1,
                    "name": "单选框-多⾏⽂本框",
                    "text": "右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试右侧文字测试",
                    "hint": "多⾏⽂本框",
                    "must": true,
                    "expand": false
                }
            },
            {
                "name": "单选框-数字⽂本框",
                "input": {
                    "type": "text",
                    "childtype": 2,
                    "hint": "数字⽂本框",
                    "text":"1223131231412313018312031875718237131591823193185757192301314175812391831718391837118316810380123612836120284651203971239175665065651026061023610630136016301",
                    "name": "单选框-数字⽂本框"
                }
            },
            {
                "name": "单选框-数字⽂本框",
                "input": {
                    "type": "text",
                    "childtype": 2,
                    "hint": "数字⽂本框",
                    "text":"1223131231412313018312031875718237131591823193185757192301314175812391831718391837118316810380123612836120284651203971239175665065651026061023610630136016301",
                    "name": "单选框-数字⽂本框"
                }
            },
            {
                "name": "单选框-数字⽂本框",
                "input": {
                    "type": "text",
                    "childtype": 2,
                    "hint": "数字⽂本框",
                    "text":"1223131231412313018312031875718237131591823193185757192301314175812391831718391837118316810380123612836120284651203971239175665065651026061023610630136016301",
                    "name": "单选框-数字⽂本框"
                }
            }
        ],
        "action": [
            {
                "name": "confirm",
                "value": "业务透传数据",
                "text": "按钮点击提交按钮点击提交按钮点击提交",
                "color": "0F82F0",
                "confirm": {
                    "title": "确定提交吗",
                    "content": "",
                    "ok": "按钮点击确定",
                    "cancel": "按钮点击取消按钮点击取消按钮点击取消"
                }
            },
            {
                "name": "cancel",
                "value": "业务透传数据",
                "text": "按钮点击取消按钮点击取消按钮点击取消",
                "color": "979CA4"
            }
        ]
    },
    "card":{
            "msgtotal":"1",
            "title":"短⽂本-居中-大号",
            "tcolor":"#3AA3E3",
            "url":"viewpage.action?pageId=9701578",
            "notice":"1",
            "click_to_delete":"1",
            "short_text":[
                {
                    "text":"短⽂本-居中-大号",
                    "tcolor":"#3AA3E3",
                    "fontsize":"3",
                    "align":"2",
                    "url":"long_text&type=card"
                }
            ]
        }
}